<div class="page-title_group">
    <div class="page-title_info">
        <h1 class="page-title">Ваши cервера</h1>
        <p class="page-description">Список всех добавленых серверов</p>
    </div>
    <div class="page-title_action">
        <div style="display:inline-block">
            <a href="/server/add" class="button button-with-icon" style="margin: 0;">
                <svg viewBox="0 0 20 20"><path fill="currentColor" d="M2.857-14.107a.705.705,0,0,0-.714.714v2.857a.705.705,0,0,0,.714.714H17.143a.705.705,0,0,0,.714-.714v-2.857a.705.705,0,0,0-.714-.714ZM0-13.393A2.877,2.877,0,0,1,2.857-16.25H17.143A2.877,2.877,0,0,1,20-13.393v2.857a2.877,2.877,0,0,1-2.857,2.857H2.857A2.877,2.877,0,0,1,0-10.536Zm11.786.357a1.086,1.086,0,0,1,1.071,1.071,1.086,1.086,0,0,1-1.071,1.071,1.086,1.086,0,0,1-1.071-1.071A1.086,1.086,0,0,1,11.786-13.036Zm2.5,1.071a1.086,1.086,0,0,1,1.071-1.071,1.086,1.086,0,0,1,1.071,1.071,1.086,1.086,0,0,1-1.071,1.071A1.086,1.086,0,0,1,14.286-11.964ZM2.857-2.679a.705.705,0,0,0-.714.714V.893a.705.705,0,0,0,.714.714H17.143a.705.705,0,0,0,.714-.714V-1.964a.705.705,0,0,0-.714-.714ZM0-1.964A2.877,2.877,0,0,1,2.857-4.821H17.143A2.877,2.877,0,0,1,20-1.964V.893A2.877,2.877,0,0,1,17.143,3.75H2.857A2.877,2.877,0,0,1,0,.893ZM10.714-.536a1.086,1.086,0,0,1,1.071-1.071A1.086,1.086,0,0,1,12.857-.536,1.086,1.086,0,0,1,11.786.536,1.086,1.086,0,0,1,10.714-.536Zm4.643-1.071A1.086,1.086,0,0,1,16.429-.536,1.086,1.086,0,0,1,15.357.536,1.086,1.086,0,0,1,14.286-.536,1.086,1.086,0,0,1,15.357-1.607Z" transform="translate(0 16.25)"/></svg>
                <span>Добавить сервер</span>
            </a>
        </div>
    </div>
</div>

<table class="table-app table-app-main" style="margin-top: 20px;">
    <thead>
        <tr>
            <th style="width: 100%;"><span class="AppTooltip" title="Информация о сервере">Сервер</span></th>
            <th style="min-width: 125px;"><span class="AppTooltip" title="Дата добавления сервера">Дата создания</span></th>
            <th><span class="AppTooltip" title="Количество активных ключей на сервере">Ключей</span></th>
            <th><span class="AppTooltip" title="Максимальное количество ключей на сервере">Лимит</span></th>
            <th></th>
        </tr>
    </thead>
    <tbody>
        <?php foreach($APP['info']['servers'] as $server): ?>
            <tr>
                <td>
                    <div style="display: flex;">
                        <div style="margin-right: 10px; padding-top: 5px;">
                            <span class="AppTooltip server-status server-status-<?=$server['status']?>" title="<?=$server['status_name']?> <?php if($server['status'] == -1) { echo("<br><span style=&quot;opacity: 0.5&quot;>Последняя проверка " . formatMinutes($server['status_date_update_min']) . " назад</span>"); } ?>"></span>
                        </div>
                        <div>
                            <span><?=$server['name']?></span>
                            <?php 
                                if($server['ip'] != '') { 
                                    echo("<br><span><code style=\"display: inline-block; margin-top: 5px;\">" . $server['ip'] . "</code></span>"); 
                                } 
                            ?>
                        </div>
                    </div>
                </td>
                <td>
                    <span><?=explode(' ', $server['date_add'])[0]?></span><br>
                    <span style="color: var(--dop-text-color)"><?=explode(' ', $server['date_add'])[1]?></span>
                </td>
                <td style="text-align:center;"><?=$server['key_count']?></td>
                <td style="text-align:center;">
                    <?php 
                        if($server['key_limit'] == -1) {
                            echo('<svg class="AppTooltip" title="Безлимитный" width="19.5" height="9.5" viewBox="0 0 19.5 9.5"><path d="M14,9.417A4.165,4.165,0,0,1,17,8a4,4,0,0,1,0,8c-4.5,0-5.5-8-10-8a4,4,0,0,0,0,8,4.165,4.165,0,0,0,3-1.417" transform="translate(-2.25 -7.25)" fill="none" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5"/></svg>');
                        } else {
                            echo('<span class="AppTooltip" title="Максимум ' . $server['key_limit'] . ' активных ключей">' . $server['key_limit'] . '</span>');
                        } 
                    ?>
                </td>
                <td>
                    <div class="menu-action_wrapper close">
                        <svg class="menu-action_btn" viewBox="0 0 16 16"><g fill="none" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5"><circle cx="8" cy="2.5" r=".75"/><circle cx="8" cy="8" r=".75"/><circle cx="8" cy="13.5" r=".75"/></g></svg>
                        <div class="menu-action_block">
                            <a href="/server/<?=$server['id']?>/key/list">
                                <svg viewBox="0 0 20 16.25"><path fill="currentColor" d="M1.875-11.875A1.851,1.851,0,0,0,3.75-13.75a1.851,1.851,0,0,0-1.875-1.875A1.851,1.851,0,0,0,0-13.75,1.851,1.851,0,0,0,1.875-11.875ZM7.5-15a1.234,1.234,0,0,0-1.25,1.25A1.234,1.234,0,0,0,7.5-12.5H18.75A1.234,1.234,0,0,0,20-13.75,1.234,1.234,0,0,0,18.75-15Zm0,6.25A1.234,1.234,0,0,0,6.25-7.5,1.234,1.234,0,0,0,7.5-6.25H18.75A1.234,1.234,0,0,0,20-7.5a1.234,1.234,0,0,0-1.25-1.25Zm0,6.25A1.234,1.234,0,0,0,6.25-1.25,1.234,1.234,0,0,0,7.5,0H18.75A1.234,1.234,0,0,0,20-1.25,1.234,1.234,0,0,0,18.75-2.5ZM1.875.625A1.851,1.851,0,0,0,3.75-1.25,1.851,1.851,0,0,0,1.875-3.125,1.851,1.851,0,0,0,0-1.25,1.851,1.851,0,0,0,1.875.625ZM3.75-7.5A1.851,1.851,0,0,0,1.875-9.375,1.851,1.851,0,0,0,0-7.5,1.851,1.851,0,0,0,1.875-5.625,1.851,1.851,0,0,0,3.75-7.5Z" transform="translate(0 15.625)"/></svg>
                                <span>Список ключей</span>
                            </a>
                            <a href="/server/<?=$server['id']?>/key/add">
                                <svg viewBox="0 0 20 20"><path fill="currentColor" d="M8.125-10.625a4.985,4.985,0,0,1,5-5,4.985,4.985,0,0,1,5,5,4.985,4.985,0,0,1-5,5,4.032,4.032,0,0,1-1.172-.156.974.974,0,0,0-.9.273L9.922-4.375H7.813a.951.951,0,0,0-.937.938v1.563H5.313a.951.951,0,0,0-.937.938V.625h-2.5V-2.422L8.008-8.555a.974.974,0,0,0,.273-.9A3.862,3.862,0,0,1,8.125-10.625Zm5-6.875A6.885,6.885,0,0,0,6.25-10.625a9.6,9.6,0,0,0,.078,1.094L.273-3.477A1.108,1.108,0,0,0,0-2.812V1.563A.951.951,0,0,0,.938,2.5H5.313a.951.951,0,0,0,.938-.937V0H7.813A.951.951,0,0,0,8.75-.937V-2.5h1.563a.857.857,0,0,0,.664-.273l1.055-1.055a10.294,10.294,0,0,0,1.094.078A6.885,6.885,0,0,0,20-10.625,6.885,6.885,0,0,0,13.125-17.5Zm1.25,6.875a1.234,1.234,0,0,0,1.25-1.25,1.234,1.234,0,0,0-1.25-1.25,1.234,1.234,0,0,0-1.25,1.25A1.234,1.234,0,0,0,14.375-10.625Z" transform="translate(0 17.5)"/></svg>
                                <span>Добавить ключ</span>
                            </a>
                            <a href="/server/edit/<?=$server['id']?>">
                                <svg viewBox="0 0 19.99 20.007"><path fill="currentColor" d="M2.3-5.2a3.37,3.37,0,0,0-.9,1.523l-1.367,5a.953.953,0,0,0,.234.9.911.911,0,0,0,.938.234L6.172,1.094A3.37,3.37,0,0,0,7.7.2L19.18-11.289A2.873,2.873,0,0,0,20-13.281a2.873,2.873,0,0,0-.82-1.992L17.773-16.68a2.873,2.873,0,0,0-1.992-.82,2.873,2.873,0,0,0-1.992.82Zm13.477-10.43a1.019,1.019,0,0,1,.664.273l1.406,1.406a.857.857,0,0,1,.273.664.942.942,0,0,1-.273.664l-2.07,2.07-2.734-2.734,2.07-2.07A1.019,1.019,0,0,1,15.781-15.625ZM4.3-4.531l7.422-7.422,2.734,2.734L7.031-1.8ZM3.164-3.008,5.508-.664l-3.2.9Z" transform="translate(-0.01 17.5)"/></svg>
                                <span>Редактировать</span>
                            </a>
                            <a href="/server/del/<?=$server['id']?>" class="action-red">
                                <svg viewBox="0 0 17.5 20.625"><path fill="currentColor" d="M6.484-18.125a1.257,1.257,0,0,0-1.172.82l-.625,1.68H.938A.951.951,0,0,0,0-14.687a.951.951,0,0,0,.938.938H16.563a.951.951,0,0,0,.938-.937.951.951,0,0,0-.937-.937h-3.75l-.625-1.68a1.257,1.257,0,0,0-1.172-.82ZM1.25-11.875V0a2.518,2.518,0,0,0,2.5,2.5h10A2.518,2.518,0,0,0,16.25,0V-11.875H14.375V0a.617.617,0,0,1-.625.625h-10A.617.617,0,0,1,3.125,0V-11.875ZM7.5-9.062A.951.951,0,0,0,6.563-10a.951.951,0,0,0-.937.938v6.875a.951.951,0,0,0,.938.938A.951.951,0,0,0,7.5-2.187Zm4.375,0A.951.951,0,0,0,10.938-10,.951.951,0,0,0,10-9.062v6.875a.951.951,0,0,0,.938.938.951.951,0,0,0,.938-.937Z" transform="translate(0 18.125)"/></svg>
                                <span>Удалить</span>
                            </a>
                        </div>
                    </div>
                </td>
            </tr>
        <?php endforeach; ?>
    </tbody>
</table>