<div class="page-title_group">
    <div class="page-title_info">
        <h1 class="page-title">Список ключей</h1>
    </div>
    <div class="page-title_action">
        <div style="display:inline-block">
            <a href="/server/list" class="button button-with-icon" style="margin: 0;">
                <svg viewBox="0 0 20 20"><path fill="currentColor" d="M2.857-14.107a.705.705,0,0,0-.714.714v2.857a.705.705,0,0,0,.714.714H17.143a.705.705,0,0,0,.714-.714v-2.857a.705.705,0,0,0-.714-.714ZM0-13.393A2.877,2.877,0,0,1,2.857-16.25H17.143A2.877,2.877,0,0,1,20-13.393v2.857a2.877,2.877,0,0,1-2.857,2.857H2.857A2.877,2.877,0,0,1,0-10.536Zm11.786.357a1.086,1.086,0,0,1,1.071,1.071,1.086,1.086,0,0,1-1.071,1.071,1.086,1.086,0,0,1-1.071-1.071A1.086,1.086,0,0,1,11.786-13.036Zm2.5,1.071a1.086,1.086,0,0,1,1.071-1.071,1.086,1.086,0,0,1,1.071,1.071,1.086,1.086,0,0,1-1.071,1.071A1.086,1.086,0,0,1,14.286-11.964ZM2.857-2.679a.705.705,0,0,0-.714.714V.893a.705.705,0,0,0,.714.714H17.143a.705.705,0,0,0,.714-.714V-1.964a.705.705,0,0,0-.714-.714ZM0-1.964A2.877,2.877,0,0,1,2.857-4.821H17.143A2.877,2.877,0,0,1,20-1.964V.893A2.877,2.877,0,0,1,17.143,3.75H2.857A2.877,2.877,0,0,1,0,.893ZM10.714-.536a1.086,1.086,0,0,1,1.071-1.071A1.086,1.086,0,0,1,12.857-.536,1.086,1.086,0,0,1,11.786.536,1.086,1.086,0,0,1,10.714-.536Zm4.643-1.071A1.086,1.086,0,0,1,16.429-.536,1.086,1.086,0,0,1,15.357.536,1.086,1.086,0,0,1,14.286-.536,1.086,1.086,0,0,1,15.357-1.607Z" transform="translate(0 16.25)"/></svg>
                <span>Список серверов</span>
            </a>
        </div>
        <div style="display:inline-block">
            <a href="/server/<?=$APP['info']['server']['id']?>/key/add" class="button button-with-icon" style="margin: 0;">
                <svg viewBox="0 0 20 20"><path fill="currentColor" d="M8.125-10.625a4.985,4.985,0,0,1,5-5,4.985,4.985,0,0,1,5,5,4.985,4.985,0,0,1-5,5,4.032,4.032,0,0,1-1.172-.156.974.974,0,0,0-.9.273L9.922-4.375H7.813a.951.951,0,0,0-.937.938v1.563H5.313a.951.951,0,0,0-.937.938V.625h-2.5V-2.422L8.008-8.555a.974.974,0,0,0,.273-.9A3.862,3.862,0,0,1,8.125-10.625Zm5-6.875A6.885,6.885,0,0,0,6.25-10.625a9.6,9.6,0,0,0,.078,1.094L.273-3.477A1.108,1.108,0,0,0,0-2.812V1.563A.951.951,0,0,0,.938,2.5H5.313a.951.951,0,0,0,.938-.937V0H7.813A.951.951,0,0,0,8.75-.937V-2.5h1.563a.857.857,0,0,0,.664-.273l1.055-1.055a10.294,10.294,0,0,0,1.094.078A6.885,6.885,0,0,0,20-10.625,6.885,6.885,0,0,0,13.125-17.5Zm1.25,6.875a1.234,1.234,0,0,0,1.25-1.25,1.234,1.234,0,0,0-1.25-1.25,1.234,1.234,0,0,0-1.25,1.25A1.234,1.234,0,0,0,14.375-10.625Z" transform="translate(0 17.5)"/></svg>
                <span>Добавить ключ</span>
            </a>
        </div>
    </div>
</div>

<table class="table-app table-app-main" style="margin-top: 20px;">
    <thead>
        <tr>
            <th style="width: 100%;"><span class="AppTooltip" title="Информация о ключе">Информация</span></th>
            <th style="min-width: 125px;"><span class="AppTooltip" title="Дата создания ключа">Дата создания</span></th>
            <th style="min-width: 125px;"><span class="AppTooltip" title="Дата окончания действия ключа">Срок действия</span></th>
            <th></th>
            <th></th>
            <th></th>
        </tr>
    </thead>
    <tbody>
        <?php foreach($APP['info']['keys'] as $keys): ?>
            <tr>
                <td>
                    <?=($keys['key_name'] != '' ? $keys['key_name'] : 'Без имени')?><br>
                    <span>Шифрование: <code style="display: inline-block; margin-top: 5px;"><?=$keys['key_method']?></code></span>
                </td>
                <td>
                    <span><?=explode(' ', $keys['date_add'])[0]?></span><br>
                    <span style="color: var(--dop-text-color)"><?=explode(' ', $keys['date_add'])[1]?></span>
                </td>
                <td><?=($keys['date_end'] != '' ? $keys['date_end'] : '—')?></td>
                <td>
                    <a onclick="copyKey('<?=$keys['key_accessUrl']?>')" class="AppTooltip" title="Скопировать ключ">
                        <svg width="20" height="20" viewBox="0 0 20 20"><path fill="currentColor" d="M8.125-10.625a4.985,4.985,0,0,1,5-5,4.985,4.985,0,0,1,5,5,4.985,4.985,0,0,1-5,5,4.032,4.032,0,0,1-1.172-.156.974.974,0,0,0-.9.273L9.922-4.375H7.813a.951.951,0,0,0-.937.938v1.563H5.313a.951.951,0,0,0-.937.938V.625h-2.5V-2.422L8.008-8.555a.974.974,0,0,0,.273-.9A3.862,3.862,0,0,1,8.125-10.625Zm5-6.875A6.885,6.885,0,0,0,6.25-10.625a9.6,9.6,0,0,0,.078,1.094L.273-3.477A1.108,1.108,0,0,0,0-2.812V1.563A.951.951,0,0,0,.938,2.5H5.313a.951.951,0,0,0,.938-.937V0H7.813A.951.951,0,0,0,8.75-.937V-2.5h1.563a.857.857,0,0,0,.664-.273l1.055-1.055a10.294,10.294,0,0,0,1.094.078A6.885,6.885,0,0,0,20-10.625,6.885,6.885,0,0,0,13.125-17.5Zm1.25,6.875a1.234,1.234,0,0,0,1.25-1.25,1.234,1.234,0,0,0-1.25-1.25,1.234,1.234,0,0,0-1.25,1.25A1.234,1.234,0,0,0,14.375-10.625Z" transform="translate(0 17.5)"/></svg>
                    </a>
                </td>
                <td>
                    <a onclick="showQRcode('<?=$keys['key_accessUrl']?>')" class="AppTooltip" title="Показать QR-код">
                        <svg width="20" height="20" viewBox="0 0 20 20"><path fill="currentColor" d="M2.5-17.5A2.518,2.518,0,0,0,0-15v2.813a.951.951,0,0,0,.938.938.951.951,0,0,0,.938-.937V-15a.617.617,0,0,1,.625-.625H5.313a.951.951,0,0,0,.938-.937.951.951,0,0,0-.937-.937Zm12.188,0a.951.951,0,0,0-.937.938.951.951,0,0,0,.938.938H17.5a.617.617,0,0,1,.625.625v2.813a.951.951,0,0,0,.938.938A.951.951,0,0,0,20-12.187V-15a2.518,2.518,0,0,0-2.5-2.5ZM1.875-2.812A.951.951,0,0,0,.938-3.75.951.951,0,0,0,0-2.812V0A2.518,2.518,0,0,0,2.5,2.5H5.313a.951.951,0,0,0,.938-.937A.951.951,0,0,0,5.313.625H2.5A.617.617,0,0,1,1.875,0ZM20-2.812a.951.951,0,0,0-.937-.937.951.951,0,0,0-.937.938V0A.617.617,0,0,1,17.5.625H14.688a.951.951,0,0,0-.937.938.951.951,0,0,0,.938.938H17.5A2.518,2.518,0,0,0,20,0ZM5.625-11.875H7.5V-10H5.625Zm-1.875,0V-10A1.875,1.875,0,0,0,5.625-8.125H7.5A1.851,1.851,0,0,0,9.375-10v-1.875A1.875,1.875,0,0,0,7.5-13.75H5.625A1.9,1.9,0,0,0,3.75-11.875Zm8.75,0h1.875V-10H12.5Zm-1.875,0V-10A1.875,1.875,0,0,0,12.5-8.125h1.875A1.851,1.851,0,0,0,16.25-10v-1.875a1.875,1.875,0,0,0-1.875-1.875H12.5A1.9,1.9,0,0,0,10.625-11.875ZM7.5-5v1.875H5.625V-5ZM5.625-6.875A1.9,1.9,0,0,0,3.75-5v1.875A1.875,1.875,0,0,0,5.625-1.25H7.5A1.851,1.851,0,0,0,9.375-3.125V-5A1.875,1.875,0,0,0,7.5-6.875Zm6.25,0a1.234,1.234,0,0,0-1.25,1.25,1.234,1.234,0,0,0,1.25,1.25,1.234,1.234,0,0,0,1.25-1.25A1.234,1.234,0,0,0,11.875-6.875ZM10.625-2.5a1.234,1.234,0,0,0,1.25,1.25,1.234,1.234,0,0,0,1.25-1.25,1.234,1.234,0,0,0-1.25-1.25A1.234,1.234,0,0,0,10.625-2.5ZM15-6.875a1.234,1.234,0,0,0-1.25,1.25A1.234,1.234,0,0,0,15-4.375a1.234,1.234,0,0,0,1.25-1.25A1.234,1.234,0,0,0,15-6.875ZM13.75-2.5A1.234,1.234,0,0,0,15-1.25,1.234,1.234,0,0,0,16.25-2.5,1.234,1.234,0,0,0,15-3.75,1.234,1.234,0,0,0,13.75-2.5Z" transform="translate(0 17.5)"/></svg>
                    </a>
                </td>
                <td>
                    <div class="menu-action_wrapper close">
                        <svg class="menu-action_btn" viewBox="0 0 16 16"><g fill="none" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5"><circle cx="8" cy="2.5" r=".75"/><circle cx="8" cy="8" r=".75"/><circle cx="8" cy="13.5" r=".75"/></g></svg>
                        <div class="menu-action_block">
                            <a href="/server/<?=$keys['server_id']?>/key/edit/<?=$keys['id']?>">
                                <svg viewBox="0 0 19.99 20.007"><path fill="currentColor" d="M2.3-5.2a3.37,3.37,0,0,0-.9,1.523l-1.367,5a.953.953,0,0,0,.234.9.911.911,0,0,0,.938.234L6.172,1.094A3.37,3.37,0,0,0,7.7.2L19.18-11.289A2.873,2.873,0,0,0,20-13.281a2.873,2.873,0,0,0-.82-1.992L17.773-16.68a2.873,2.873,0,0,0-1.992-.82,2.873,2.873,0,0,0-1.992.82Zm13.477-10.43a1.019,1.019,0,0,1,.664.273l1.406,1.406a.857.857,0,0,1,.273.664.942.942,0,0,1-.273.664l-2.07,2.07-2.734-2.734,2.07-2.07A1.019,1.019,0,0,1,15.781-15.625ZM4.3-4.531l7.422-7.422,2.734,2.734L7.031-1.8ZM3.164-3.008,5.508-.664l-3.2.9Z" transform="translate(-0.01 17.5)"/></svg>
                                <span>Редактировать</span>
                            </a>
                            <a href="/server/<?=$keys['server_id']?>/key/del/<?=$keys['id']?>" class="action-red">
                                <svg viewBox="0 0 17.5 20.625"><path fill="currentColor" d="M6.484-18.125a1.257,1.257,0,0,0-1.172.82l-.625,1.68H.938A.951.951,0,0,0,0-14.687a.951.951,0,0,0,.938.938H16.563a.951.951,0,0,0,.938-.937.951.951,0,0,0-.937-.937h-3.75l-.625-1.68a1.257,1.257,0,0,0-1.172-.82ZM1.25-11.875V0a2.518,2.518,0,0,0,2.5,2.5h10A2.518,2.518,0,0,0,16.25,0V-11.875H14.375V0a.617.617,0,0,1-.625.625h-10A.617.617,0,0,1,3.125,0V-11.875ZM7.5-9.062A.951.951,0,0,0,6.563-10a.951.951,0,0,0-.937.938v6.875a.951.951,0,0,0,.938.938A.951.951,0,0,0,7.5-2.187Zm4.375,0A.951.951,0,0,0,10.938-10,.951.951,0,0,0,10-9.062v6.875a.951.951,0,0,0,.938.938.951.951,0,0,0,.938-.937Z" transform="translate(0 18.125)"/></svg>
                                <span>Удалить</span>
                            </a>
                        </div>
                    </div>
                </td>
            </tr>
        <?php endforeach; ?>
    </tbody>
</table>

<dialog id="dialog_QR_code">
    <div class="dialog-content">
        <div id="QR_code"></div>
    </div>
</dialog>

<script src="/assets/libs/qrcode.min.js"></script>

<script type="text/javascript">
    function copyKey(text) {
        copyTextInBuffer(text, function(){
            notification({
                'html': '<p>Ключ скопирован в буфер</p>'
            });
        });
    }
    
    var QR_code = new QRCode(document.getElementById("QR_code"), {
        text: "",
        width: 500,
        height: 500,
        colorDark : "#ebebeb",
        colorLight : "#212323",
        correctLevel : QRCode.CorrectLevel.H
    });
    
    // Закрытие по клику на backdrop
    document.getElementById('dialog_QR_code').addEventListener('click', function(e) {
        if (e.target === this) {
            this.close();
        }
    });
    
    // Закрытие по Escape
    document.getElementById('dialog_QR_code').addEventListener('cancel', function(e) {
        e.preventDefault();
        this.close();
    });
    
    function showQRcode(text) {
        // Меняем QR-код        
        QR_code.clear();
        QR_code.makeCode(text);

        $('#QR_code').removeAttr('title');

         // Показываем как модальное окно
        document.getElementById('dialog_QR_code').showModal();
    }
    
</script>